# 6. Необходимо создать (не программно) текстовый файл, где
# каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
# Вывести словарь на экран.

dict = {}

import re

with open('hw5-6.txt', 'r') as file:
    for line in file:
        predmet = line.split(':')
        print(predmet[0])

        hrs = re.findall(r'\b\d+\b',line)

        total_hrs = 0
        for hr in hrs:
            total_hrs += int(hr)

        dict[predmet[0]] = total_hrs

print(dict)
